{
  "basics": {
    "name": "Mohammad K. Hussain",
    "nickname": "MAX-786",
    "label": "Software Developer with expertise in web technologies",
    "summary": "Passionate about building innovative solutions and contributing to open source projects. Experienced in full-stack development with a focus on modern web technologies.",
    "location": {
      "city": "",
      "countryCode": "+91",
      "region": ""
    },
    "socials": [
      {
        "network": "email",
        "url": "mailto:hussainmohammad328@gmail.com"
      },
      {
        "network": "github",
        "url": "https://github.com/MAX-786"
      },
      {
        "network": "linkedin",
        "url": "https://linkedin.com/in/mohammad-k-hussain"
      }
    ]
  },
  "work": [
    {
      "name": "Sutra AI (StringVentures)",
      "position": "SDE Intern",
      "location_type": "Remote",
      "location": "India",
      "url": "",
      "startDate": "2025-01-01",
      "endDate": null,
      "summary": "Working on server-side APIs and frontend development",
      "responsibilities": [
        "Developed and optimized server-side APIs using Node.js and Express, implementing efficient data handling and caching strategies to improve response times",
        "Implemented dynamic UI components and state management in the Next.js frontend, enhancing user experience and performance",
        "Collaborated with senior developers to integrate RESTful APIs and handle authentication flows using JWT and OAuth for secure user access"
      ]
    },
    {
      "name": "Plone Foundation",
      "position": "Google Summer of Code 2024 Participant",
      "location_type": "Remote",
      "location": "Global",
      "url": "https://github.com/collective/volto-hydra/tree/main",
      "startDate": "2024-05-01",
      "endDate": "2024-08-01",
      "summary": "Created a proof-of-concept for using Volto as a decoupled editor for Plone through the Hydra project",
      "responsibilities": [
        "Created a proof-of-concept for using Volto as a decoupled editor for Plone through the Hydra project, allowing frontends built with any framework (React, Vue, etc.) to edit Plone content",
        "Implemented a staged approach for frontend integration with Hydra's bridge, enabling basic editing experiences to full Volto-like inline editing",
        "Developed functionalities for frontends to identify and manage editable blocks within the Hydra editor, including features like block selection, Quanta toolbar integration, and live content updates"
      ]
    },
    {
      "name": "Hybrid Additive Manufacturing (HAM) Lab, IIITDM Jabalpur",
      "position": "Web Developer",
      "location_type": "On-site",
      "location": "Jabalpur, MP",
      "url": "",
      "startDate": "2023-09-01",
      "endDate": "2023-12-01",
      "summary": "Designed and developed a responsive landing website for the HAM lab",
      "responsibilities": [
        "Worked with a team of 8 to design and develop a responsive landing website for the HAM lab at IIITDM Jabalpur",
        "Conducted user tests and gathered feedback to improve the site's performance and functionality, making it more user-friendly and informative"
      ]
    }
  ],
  "education": [
    {
      "institution": "Indian Institute of Information Technology Jabalpur",
      "url": "https://iiitdmj.ac.in/",
      "area": "Smart Manufacturing",
      "studyType": "Bachelor of Technology",
      "startDate": "2021-08-01",
      "endDate": "2025-05-01",
      "summary": "CPI: 7.4"
    }
  ],
  "awards": [
    {
      "title": "Plone Conference 2024 Speaker",
      "date": "2024",
      "awarder": "Plone Foundation",
      "summary": "Invited as a speaker at the Plone Conference 2024 in Brasília, Brazil. Delivered a lightning talk on my GSoC journey with Plone and conducted a live demo showcasing the power of Hydra, a decoupled editor for Plone."
    },
    {
      "title": "Bank of Baroda Hackathon Finalist",
      "date": "2023",
      "awarder": "Bank of Baroda",
      "summary": "Our idea made it into the top 10 in the BoB hackathon."
    },
    {
      "title": "LeetCode Achievement",
      "date": "Ongoing",
      "awarder": "LeetCode",
      "summary": "Solved 750+ questions on LeetCode (Profile: HiPHEN001)"
    }
  ],
  "skills": {
    "programming_languages": ["C++", "JavaScript", "Python"],
    "frameworks": ["React", "Node.js", "Express", "Next.js"],
    "databases": ["MongoDB", "Firebase"],
    "tools": ["Git", "Docker", "VS Code", "Unix/Linux"]
  },
  "projects": [
    {
      "name": "Saveland",
      "description": "Linux window management utility for layout preservation across desktop environments",
      "url": "https://github.com/MAX-786/saveland",
      "highlights": [
        "Developed cross-desktop solution supporting both Hyprland (Wayland) and GNOME (X11) environments",
        "Engineered low-level window manipulation using hyprctl JSON interface and X11 tools (wmctrl/xdotool)",
        "Implemented workspace-aware window tracking with automatic environment detection",
        "Solved complex edge cases for application-specific window management (terminals, browsers, IDEs)",
        "Designed CLI interface with layout versioning and multi-instance application support"
      ],
      "technologies": [
        "Bash",
        "Python",
        "Hyprland",
        "X11/Wayland",
        "Linux System Programming"
      ]
    },
    {
      "name": "KYPE",
      "description": "A web application for professor reviews",
      "url": "https://kype.vercel.app/",
      "highlights": [
        "Developed React-based frontend for a KYPE web app, creating an intuitive and responsive user interface",
        "Utilized MongoDB as the backend database for efficient storage and retrieval of professor reviews, ensuring scalability and optimal performance",
        "Implemented robust features, including user authentication, search functionality, and review submission forms"
      ],
      "technologies": ["React", "MaterialUI", "MongoDB", "Firebase", "Git"]
    },
    {
      "name": "Qissa the Story Bot",
      "description": "A Discord bot for collaborative storytelling",
      "url": "https://github.com/MAX-786/Qissa",
      "highlights": [
        "Developed Qissa, a Discord bot using JavaScript and Discord.js",
        "Enables story creation, collaboration, and timeline management within Discord servers",
        "Users can initialize stories, contribute, create timelines, and add events"
      ],
      "technologies": ["JavaScript", "Node.js", "MongoDB", "Git"]
    },
    {
      "name": "Volto-Hydra",
      "description": "A decoupled editor for Plone CMS",
      "url": "https://github.com/collective/volto-hydra/tree/main",
      "highlights": [
        "Created a proof-of-concept for using Volto as a decoupled editor for Plone",
        "Implemented a staged approach for frontend integration with Hydra's bridge",
        "Developed functionalities for frontends to identify and manage editable blocks"
      ],
      "technologies": ["React", "JavaScript", "Plone", "CMS"]
    }
  ]
}
